package p02.lecture;

public class A03TypeByte {
	public static void main(String[] args) {
		// byte : 1byte 크기의 정수를 저장할 수 있다!
		// 1byte == 8bit 
		// 0000 0000 ~ 1111 1111 
		
		// 십진법 0 == 0000 0000
		// 십진법 1 == 0000 0001
		// 십진법 2 == 0000 0010
		// 십진법 3 == 0000 0011
		// .
		// .
		// .
		// 십진법 127 == 0111 1111
		// 십진법 -128 == 1000 0000 // 가장 왼쪽의 bit가 1이면, 음수로 판단한다. 
		// 십진법 -127 == 1000 0001 
		// 십진법 -126 == 1000 0010
		// .
		// .
		// .
		// 십진법 -1 == 1111 1111
		// 십진법 0 == 0000 0000 (다시 reset - 공간의 제약으로 인해 올라갈 1이 사라진당) 
		// 총 256개의 수를 표현할 수 있다 (양수 127개 + 음수 128개 = 256개)
		
		// 최소값 = -128
		// 최대값 = 127
		
		byte byteVar;
		byteVar = -128;
		byteVar = 127;
		
//		byteVar = -129; -> bad
//		byteVar = 128; -> bad
		
		
	}
}
